# Product Launch Timing

Timing of the product launch is the most important marketing business decision in order to have maximum attention. From this dataset; I will like to know in which month there are most meetings between our 4 account managers and 35 of our client. Also we will like to know the freequency of these meetings in the month.

These 2 results will give us a general idea when to launch the product to have the maximum excitement

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

# Reading the dataset2
data= pd.read_csv("C:/Users/dexter/Desktop/hireart/data.csv")

In [3]:
data.head()

  Account manager                 Client Name Date of Contact
0     Milan Crona     Wyman, Farrell and Haag      2015-10-31
1    Aidan Pouros  Veum, McClure and Schuster      2013-12-15
2    Aidan Pouros  Veum, McClure and Schuster      2013-12-07
3     Milan Crona             Armstrong Group      2013-11-02
4    Aidan Pouros   Lueilwitz, Moore and Hahn      2013-12-25

In [6]:
#converting to datetime
data['Date of Contact'] = pd.to_datetime(data['Date of Contact']) #converting to datetime

#missing values
data.isna().sum()

Account manager    0
Client Name        0
Date of Contact    0
dtype: int64

We have 4 account managers and 35 clients as shown below

In [7]:
data.describe()

       Account manager        Client Name      Date of Contact
count             1001               1001                 1001
unique               4                 35                  704
top        Milan Crona  Eichmann and Sons  2013-10-11 00:00:00
freq               286                 38                    7
first              NaN                NaN  2013-10-03 00:00:00
last               NaN                NaN  2017-09-29 00:00:00

In [13]:
data["month"]= data["Date of Contact"].dt.month
data.head()

  Account manager                 Client Name Date of Contact  month
0     Milan Crona     Wyman, Farrell and Haag      2015-10-31     10
1    Aidan Pouros  Veum, McClure and Schuster      2013-12-15     12
2    Aidan Pouros  Veum, McClure and Schuster      2013-12-07     12
3     Milan Crona             Armstrong Group      2013-11-02     11
4    Aidan Pouros   Lueilwitz, Moore and Hahn      2013-12-25     12

In [30]:
#Groupby month aggregate the number of  distinct clients
result= data[["Client Name", "month"]].groupby("month").agg({"Client Name": ["nunique", "count"]})

In [31]:
result

      Client Name
          nunique count
month
1              30    60
2              31    64
3              29    58
4              26    52
5              33    69
6              34    77
7              28    66
8              33    79
9              33   121
10             35   213
11             30    65
12             32    77

We can see from the above data that month 10 i.e. October has the most number of meetings and all of the 35 clients are present.
Hence It make sense to launch the product in october.